{
    "prefix": "~",
    "commands": {
        "help [name of command]": "Retrieves a list of all commands & other useful information.",
        "rating [username & tag]": "Retrieves the user's rating. Will enter the user into the database if not already.",
        "match <winner username & tag> <loser username & tag>": "Records the results of a match into the database. Will enter the user into the database if not already.",
        "winrate [username & tag]": "Retrieves the user's winrate. Will enter the user into the database if not already.",
        "top ['rating' or 'winrate' (without quotation marks] [how many users to display]": "Retrieves the top users from the category of choice (category will default to rating). The number of users to retrieve can also be specified (defaults to 10).",
        "de": "Displays a wonderful ascii art of de by Shulk Tiem.",
        "dab": "bruh moment",
        "floss": "bruh moment #2",
        "code": "Sends a link to the GitHub repo."
        },
    "secrets": {
        "set [username & tag] <value>": "Sets a user's rating to a specified value. Not specifying will default to affecting the sender of the message only. For Dev user only.",
        "reset [username & tag or the word 'global' (without quotation marks)]": "Resets a user's rating or the entire database if given the option. Not specifying will default to affecting the sender of the message only. For Dev use only.",
        "undo [username & tag] [number of undos to execute]": "(WIP do not test) Undoes the last x change(s) to the user's rating. Not specifying will default to affecting the sender of the message only. Ajusts various other variables in the process. For Dev use only.",
        "config [component] [value]": "(WIP do not test) Will query either a specific or all components in the server's config. If a value is specified it will set the component to that value. For Dev use only."
    },
    "components": {
        "starting_rating": "How much rating each player should start with. (Default: `1000`).",
        "min_rating": "The minimum possible rating. Set as `-1` to make it infinitely low. (Default: `1000`).",
        "max_rating": "The maximum possible rating. Set as `-1` to make it infinite. (Default: `-1`).",
        "history": "Whether or not to keep a log of commands executed for this server. Disabling this will also disable the `~undo` command. (Default: `true`).",
        "winrate": "Whether or not to keep track of winrate on this server. Disabling this will also disable the `~winrate` command. (Default: `true`).",
        "command_channels": "A list of channels that commands are allowed to be sent in. Will default to all channels if left empty. (Default: `(empty)`)."
    },
    "types": {
        "match": ["winner", "loser"],
        "set": ["user", "pre_rating", "post_rating"],
        "reset": ["global", "user", "rating", "results"],
        "config": ["user", "changes"]
    }
}